Revit 2024 API
PartUtils.ArePartsValidForDivide Method
 Identifies if provided members are valid for dividing parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static bool ArePartsValidForDivide(
	Document document,
	ICollection<ElementId> elementIdsToDivide
)
Visual Basic
Public Shared Function ArePartsValidForDivide ( _
	document As Document, _
	elementIdsToDivide As ICollection(Of ElementId) _
) As Boolean
Visual C++
public:
static bool ArePartsValidForDivide(
	Document^ document,
	ICollection<ElementId^>^ elementIdsToDivide
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
elementIdsToDivide
Type: System.Collections.Generic.ICollection<ElementId>
 Element ids to be tested for validity for dividing parts.
Return Value
 True if all member ids are valid, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PartUtils Class
Autodesk.Revit.DB Namespace